## 操作SQLITE

In [1]:
import sqlite3 as lite
con = lite.connect('test.sqlite')
cur = con.cursor()

cur.execute('SELECT SQlITE_VERSION()')
data = cur.fetchone()

con.close()

In [2]:
data

('3.21.0',)

In [3]:
import sqlite3 as lite

with lite.connect('test.sqlite') as con:
    cur = con.cursor()

    cur.execute('SELECT SQlITE_VERSION()')
    data = cur.fetchone()

In [5]:
data

('3.21.0',)

In [6]:
with lite.connect("test.sqlite") as con:
    cur = con.cursor()
    cur.execute("DROP TABLE IF EXISTS PhoneAddress")
    
    cur.execute("""
        CREATE TABLE PhoneAddress(
            phone   CHAR(10) PRIMARY KEY, 
            address TEXT, 
            name    TEXT unique,
            age     INT NOT NULL
        )""")
    
    cur.execute("INSERT INTO PhoneAddress VALUES('0912173381','United State','Jhon Doe',53)")
    cur.execute("INSERT INTO PhoneAddress VALUES('0928375018','Tokyo Japan','MuMu Cat',6)")
    cur.execute("INSERT INTO PhoneAddress VALUES('0957209108','Taipei','Richard',29)")
    cur.execute("SELECT phone,address FROM PhoneAddress")
    
    data = cur.fetchall()

In [7]:
data

[('0912173381', 'United State'),
 ('0928375018', 'Tokyo Japan'),
 ('0957209108', 'Taipei')]

In [8]:
for rec in data:
    print(rec[0], rec[1])

0912173381 United State
0928375018 Tokyo Japan
0957209108 Taipei

In [9]:
with lite.connect("test.sqlite") as con:
    cur = con.cursor()
    cur.execute("SELECT phone,address FROM PhoneAddress")  
    data1 = cur.fetchone()
    data2 = cur.fetchall()

In [10]:
data1

('0912173381', 'United State')

In [11]:
data2

[('0928375018', 'Tokyo Japan'), ('0957209108', 'Taipei')]

In [12]:
with lite.connect("test.sqlite") as con:
    cur = con.cursor()
    cur.execute("SELECT * FROM PhoneAddress")  
    data = cur.fetchall()

In [13]:
data

[('0912173381', 'United State', 'Jhon Doe', 53),
 ('0928375018', 'Tokyo Japan', 'MuMu Cat', 6),
 ('0957209108', 'Taipei', 'Richard', 29)]

In [14]:
import pandas
employee = [
    {'name':'Mary', 'age':23 , 'gender': 'F'},
    {'name':'John', 'age':33 , 'gender': 'M'}]

df = pandas.DataFrame(employee)

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
age       2 non-null int64
gender    2 non-null object
name      2 non-null object
dtypes: int64(1), object(2)
memory usage: 128.0+ bytes

In [17]:
with lite.connect('test.sqlite') as con:
    df.to_sql('employee', con = con)

In [18]:
with lite.connect("test.sqlite") as con:
    cur = con.cursor()
    cur.execute("SELECT * FROM employee")  
    data = cur.fetchall()
    print(data)

[(0, 23, 'F', 'Mary'), (1, 33, 'M', 'John')]

In [20]:
with lite.connect('test.sqlite') as con:
    df2 = pandas.read_sql_query('SELECT * FROM employee', con = con)

In [21]:
df2

   index  age gender  name
0      0   23      F  Mary
1      1   33      M  John

In [22]:
import pandas
df = pandas.read_csv('https://raw.githubusercontent.com/ywchiu/tibamepy/master/data/rent_591_sample2.csv', index_col=0)

In [24]:
df['price'] = df['price'].map(lambda e : int(e.replace('元/月','').replace(',','')))

In [28]:
df['search_date']  = pandas.to_datetime(df['search_date'], format = '%Y-%m-%d')

In [30]:
df['btype'] = df['building_use'].map(lambda e: str(e).split('/')[0])
df['buse'] = df['building_use'].map(lambda e: str(e).split('/')[1] if len(str(e).split('/'))> 1 else None)

In [32]:
with lite.connect('test.sqlite') as con:
    df.to_sql('rent_591', con = con, index = None)

In [44]:
with lite.connect('test.sqlite') as con:
    #df2 = pandas.read_sql_query('SELECT * FROM rent_591', con = con)
    #df2 = pandas.read_sql_query('SELECT * FROM rent_591 WHERE price > 10000', con = con)
    #df2 = pandas.read_sql_query('SELECT title, building_area, price FROM rent_591', con = con)
    #df2 = pandas.read_sql_query('SELECT title, building_area, price FROM rent_591 ORDER BY price DESC', con = con)
    #df2 = pandas.read_sql_query('SELECT avg(price/building_area) FROM rent_591', con = con)
    #df2 = pandas.read_sql_query('SELECT buse, btype, avg(price/building_area) FROM rent_591 group by buse, btype', con = con)
    #df2 = pandas.read_sql_query('SELECT title, building_area, price FROM rent_591 ORDER BY price DESC LIMIT 3', con = con)
    #df2 = pandas.read_sql_query('SELECT btype, avg(price) FROM rent_591 group by btype', con = con)
    df2 = pandas.read_sql_query('SELECT btype, avg(price) FROM rent_591 group by btype HAVING avg(price) > 10000', con = con)
df2

  btype     avg(price)
0   nan   84789.830692
1    倉庫   25248.425926
2    公寓   16350.106894
3    別墅   25951.827907
4    廠房   76662.857143
5    廠辦  100681.818182
6   透天厝   17622.803203
7  電梯大樓   47822.119324

## 操作MySQL

## MySQL 
- https://dev.mysql.com/get/Downloads/MySQLInstaller/mysql-installer-community-8.0.12.0.msi
- https://www.microsoft.com/en-us/download/confirmation.aspx?id=42642

In [45]:
import mysql.connector

cnx = mysql.connector.connect(user='root', password='test',
                              host='127.0.0.1',
                              database='house')
cnx.close()

In [49]:
import mysql.connector

cnx = mysql.connector.connect(user='root', password='test',
                              host='127.0.0.1',
                              database='house')
cursor = cnx.cursor()

query = ("""
        CREATE TABLE PhoneAddress(
            phone   CHAR(10) PRIMARY KEY, 
            address VARCHAR(1024), 
            name    VARCHAR(1024),
            age     INT NOT NULL
        )""")

cursor.execute(query)
cursor.close()
cnx.close()

In [51]:
import mysql.connector

cnx = mysql.connector.connect(user='root', password='test',
                              host='127.0.0.1',
                              database='house')
cursor = cnx.cursor()


cursor.execute(("INSERT INTO PhoneAddress VALUES('0912173381','United State','Jhon Doe',53)"))
cursor.execute(("INSERT INTO PhoneAddress VALUES('0928375018','Tokyo Japan','MuMu Cat',6)"))
cursor.execute(("INSERT INTO PhoneAddress VALUES('0957209108','Taipei','Richard',29)"))
cnx.commit()
cursor.close()
cnx.close()

In [52]:
import mysql.connector

cnx = mysql.connector.connect(user='root', password='test',
                              host='127.0.0.1',
                              database='house')
cursor = cnx.cursor()


cursor.execute(("SELECT * FROM PhoneAddress"))
for rec in cursor:
    print(rec)
cursor.close()
cnx.close()

('0912173381', 'United State', 'Jhon Doe', 53)
('0928375018', 'Tokyo Japan', 'MuMu Cat', 6)
('0957209108', 'Taipei', 'Richard', 29)

## SQL ALchemy
- https://docs.sqlalchemy.org/en/latest/core/engines.html

#### default
- engine = create_engine('mysql://scott:tiger@localhost/foo')

#### mysql-python
- engine = create_engine('mysql+mysqldb://scott:tiger@localhost/foo')

#### MySQL-connector-python
- engine = create_engine('mysql+mysqlconnector://scott:tiger@localhost/foo')

#### OurSQL
- engine = create_engine('mysql+oursql://scott:tiger@localhost/foo')

In [64]:
from sqlalchemy import create_engine
engine = create_engine("mysql+mysqlconnector://root:test@localhost/house")
df.head(1000).to_sql('rent_591', engine,if_exists='replace', chunksize=100)

## 敘述性統計

In [66]:
! pip install pandas-datareader

Collecting pandas-datareader
  Downloading https://files.pythonhosted.org/packages/cc/5c/ea5b6dcfd0f55c5fb1e37fb45335ec01cceca199b8a79339137f5ed269e0/pandas_datareader-0.7.0-py2.py3-none-any.whl (111kB)
Requirement already satisfied: requests>=2.3.0 in c:\programdata\anaconda3\lib\site-packages (from pandas-datareader) (2.18.4)
Requirement already satisfied: pandas>=0.19.2 in c:\programdata\anaconda3\lib\site-packages (from pandas-datareader) (0.23.0)
Requirement already satisfied: lxml in c:\programdata\anaconda3\lib\site-packages (from pandas-datareader) (4.2.1)
Requirement already satisfied: wrapt in c:\programdata\anaconda3\lib\site-packages (from pandas-datareader) (1.10.11)
Requirement already satisfied: chardet<3.1.0,>=3.0.2 in c:\programdata\anaconda3\lib\site-packages (from requests>=2.3.0->pandas-datareader) (3.0.4)
Requirement already satisfied: idna<2.7,>=2.5 in c:\programdata\anaconda3\lib\site-packages (from requests>=2.3.0->pandas-datareader) (2.6)
Requirement already satisfied: urllib3<1.23,>=1.21.1 in c:\programdata\anaconda3\lib\site-packages (from requests>=2.3.0->pandas-datareader) (1.22)
Requirement already satisfied: certifi>=2017.4.17 in c:\programdata\anaconda3\lib\site-packages (from requests>=2.3.0->pandas-datareader) (2018.4.16)
Requirement already satisfied: numpy>=1.9.0 in c:\programdata\anaconda3\lib\site-packages (from pandas>=0.19.2->pandas-datareader) (1.14.3)
Requirement already satisfied: python-dateutil>=2.5.0 in c:\programdata\anaconda3\lib\site-packages (from pandas>=0.19.2->pandas-datareader) (2.7.3)
Requirement already satisfied: pytz>=2011k in c:\programdata\anaconda3\lib\site-packages (from pandas>=0.19.2->pandas-datareader) (2018.4)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.5.0->pandas>=0.19.2->pandas-datareader) (1.11.0)
Installing collected packages: pandas-datareader
Successfully installed pandas-datareader-0.7.0

mysql-connector-python 8.0.12 requires protobuf>=3.0.0, which is not installed.
distributed 1.21.8 requires msgpack, which is not installed.
You are using pip version 10.0.1, however version 18.1 is available.
You should consider upgrading via the 'python -m pip install --upgrade pip' command.

In [75]:
from pandas_datareader import get_data_yahoo
df = get_data_yahoo('2330.TW', start = '2000-01-01')

In [76]:
df.head()

,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,
2000-01-04,69.649002,68.475197,69.649002,69.649002,2.006623e+11,69.649002
2000-01-05,71.214104,68.866302,69.649002,71.214104,4.024668e+11,71.214104
2000-01-06,71.214104,69.649002,70.822899,69.649002,1.975457e+11,69.649002
2000-01-07,68.475197,66.518600,67.301300,67.692497,2.352703e+11,67.692497
2000-01-10,70.431396,68.475197,69.649002,70.040199,2.761717e+11,70.040199

In [78]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 4629 entries, 2000-01-04 to 2018-10-05
Data columns (total 6 columns):
High         4629 non-null float64
Low          4629 non-null float64
Open         4629 non-null float64
Close        4629 non-null float64
Volume       4629 non-null float64
Adj Close    4629 non-null float64
dtypes: float64(6)
memory usage: 253.1 KB

In [80]:
df.describe()

,High,Low,Open,Close,Volume,Adj Close
count,4629.000000,4629.000000,4629.000000,4629.000000,4.629000e+03,4629.000000
mean,89.946145,88.292083,89.147409,89.160124,2.453763e+10,89.160124
std,55.644840,55.103057,55.402829,55.399214,4.629421e+10,55.399214
min,27.612900,26.918800,26.995701,27.458401,0.000000e+00,27.458401
25%,52.448700,50.906200,51.677502,51.677502,3.224732e+07,51.677502
50%,65.131897,63.956200,64.524597,64.599998,5.175500e+07,64.599998
75%,110.000000,108.500000,109.500000,109.500000,4.230744e+10,109.500000
max,268.000000,262.500000,268.000000,266.000000,4.476381e+11,266.000000

In [82]:
df.dtypes

High         float64
Low          float64
Open         float64
Close        float64
Volume       float64
Adj Close    float64
dtype: object

In [85]:
df['Close'].min()

27.45840072631836

In [87]:
df['Close'].max()

266.0

In [88]:
df['Close'].count()

4629

### 找出數據中心

In [90]:
df['Close'].mean()

89.1601240282106

In [91]:
df['Close'].median()

64.5999984741211

In [95]:
a = pandas.Series([1,1,2,2,3,3,1,1,2])
a.value_counts()

1    4
2    3
3    2
dtype: int64

In [99]:
import random
temp = [random.randint(0,30) for e in range(1,100)]

In [104]:
sum(temp) / len(temp)

15.8989898989899

In [105]:
temp.extend([999,999,999])

In [107]:
sum(temp) / len(temp)

44.81372549019608

In [109]:
temp.sort()

In [112]:
len(temp) / 2

51.0

In [113]:
temp[50]

16

In [116]:
from collections import Counter
c = Counter(temp)
c.most_common(10)

[(27, 8),
 (30, 8),
 (4, 6),
 (26, 5),
 (1, 4),
 (6, 4),
 (11, 4),
 (14, 4),
 (15, 4),
 (25, 4)]